package open.dolphin.util;

import java.util.GregorianCalendar;
import java.util.HashSet;

/**
 * 休日かどうか調べる
 *
 * @author masuda, Masuda Naika
 */
public class Holiday {

    private static final HashSet<GregorianCalendar> holidays;

    private static final int[][] holidayData = {
        {2009, 1, 1},
        {2009, 1, 12},
        {2009, 2, 11},
        {2009, 3, 20},
        {2009, 4, 29},
        {2009, 5, 4},
        {2009, 5, 5},
        {2009, 5, 6},
        {2009, 7, 20},
        {2009, 9, 21},
        {2009, 9, 22},
        {2009, 9, 23},
        {2009, 10, 12},
        {2009, 11, 3},
        {2009, 11, 23},
        {2009, 12, 23},
        {2010, 1, 1},
        {2010, 1, 11},
        {2010, 2, 11},
        {2010, 3, 22},
        {2010, 4, 29},
        {2010, 5, 3},
        {2010, 5, 4},
        {2010, 5, 5},
        {2010, 7, 19},
        {2010, 9, 20},
        {2010, 9, 23},
        {2010, 10, 11},
        {2010, 11, 3},
        {2010, 11, 23},
        {2010, 12, 23},
        {2011, 1, 1},
        {2011, 1, 10},
        {2011, 2, 11},
        {2011, 3, 21},
        {2011, 4, 29},
        {2011, 5, 3},
        {2011, 5, 4},
        {2011, 5, 5},
        {2011, 7, 18},
        {2011, 9, 19},
        {2011, 9, 23},
        {2011, 10, 10},
        {2011, 11, 3},
        {2011, 11, 23},
        {2011, 12, 23},
        {2012, 1, 2},
        {2012, 1, 9},
        {2012, 2, 11},
        {2012, 3, 20},
        {2012, 4, 30},
        {2012, 5, 3},
        {2012, 5, 4},
        {2012, 5, 5},
        {2012, 7, 16},
        {2012, 9, 17},
        {2012, 9, 22},
        {2012, 10, 8},
        {2012, 11, 3},
        {2012, 11, 23},
        {2012, 12, 24},
        {2013, 1, 1},
        {2013, 1, 14},
        {2013, 2, 11},
        {2013, 3, 20},
        {2013, 4, 29},
        {2013, 5, 3},
        {2013, 5, 4},
        {2013, 5, 6},
        {2013, 7, 15},
        {2013, 9, 16},
        {2013, 9, 23},
        {2013, 10, 14},
        {2013, 11, 4},
        {2013, 11, 23},
        {2013, 12, 23},
        {2014, 1, 1},
        {2014, 1, 13},
        {2014, 2, 11},
        {2014, 3, 21},
        {2014, 4, 29},
        {2014, 5, 3},
        {2014, 5, 5},
        {2014, 5, 6},
        {2014, 7, 21},
        {2014, 9, 15},
        {2014, 9, 23},
        {2014, 10, 13},
        {2014, 11, 3},
        {2014, 11, 24},
        {2014, 12, 23},
        {2015, 1, 1},
        {2015, 1, 12},
        {2015, 2, 11},
        {2015, 3, 21},
        {2015, 4, 29},
        {2015, 5, 4},
        {2015, 5, 5},
        {2015, 5, 6},
        {2015, 7, 20},
        {2015, 9, 21},
        {2015, 9, 22},
        {2015, 9, 23},
        {2015, 10, 12},
        {2015, 11, 3},
        {2015, 11, 23},
        {2015, 12, 23},
        {2016, 1, 1},
        {2016, 1, 11},
        {2016, 2, 11},
        {2016, 3, 21},
        {2016, 4, 29},
        {2016, 5, 3},
        {2016, 5, 4},
        {2016, 5, 5},
        {2016, 7, 18},
        {2016, 8, 11},
        {2016, 9, 19},
        {2016, 9, 22},
        {2016, 10, 10},
        {2016, 11, 3},
        {2016, 11, 23},
        {2016, 12, 23},
        {2017, 1, 2},
        {2017, 1, 9},
        {2017, 2, 11},
        {2017, 3, 20},
        {2017, 4, 29},
        {2017, 5, 3},
        {2017, 5, 4},
        {2017, 5, 5},
        {2017, 7, 17},
        {2017, 8, 11},
        {2017, 9, 18},
        {2017, 9, 23},
        {2017, 10, 9},
        {2017, 11, 3},
        {2017, 11, 23},
        {2017, 12, 23},
        {2018, 1, 1},
        {2018, 1, 8},
        {2018, 2, 12},
        {2018, 3, 21},
        {2018, 4, 30},
        {2018, 5, 3},
        {2018, 5, 4},
        {2018, 5, 5},
        {2018, 7, 16},
        {2018, 8, 11},
        {2018, 9, 17},
        {2018, 9, 24},
        {2018, 10, 8},
        {2018, 11, 3},
        {2018, 11, 23},
        {2018, 12, 24},
        {2019, 1, 1},
        {2019, 1, 14},
        {2019, 2, 11},
        {2019, 3, 21},
        {2019, 4, 29},
        // アベくそは頭悪いから１０連休になると病院の中の人が大変なことになるということが理解できない
        {2019, 4, 30},  // 新天皇即位日は祝日
        {2019, 5, 1},   // 新天皇即位日は祝日
        {2019, 5, 2},   // 新天皇即位日は祝日
        {2019, 5, 3},
        {2019, 5, 4},
        {2019, 5, 6},
        {2019, 7, 15},
        {2019, 8, 12},
        {2019, 9, 16},
        {2019, 9, 23},
        {2019, 10, 14},
        {2019, 10, 22}, // 即位礼正殿の儀
        {2019, 11, 4},
        {2019, 11, 23},
        {2019, 12, 23},
        {2020, 1, 1},
        {2020, 1, 13},
        {2020, 2, 11},
        {2020, 3, 20},
        {2020, 4, 29},
        {2020, 5, 4},
        {2020, 5, 5},
        {2020, 5, 6},
//        {2020, 7, 20},
        {2020, 7, 23},  // 改正五輪特措法 海の日 7/20->7/23
        {2020, 7, 24},  // 改正五輪特措法 体育の日　10/12->7/24
        {2020, 8, 10},  // 改正五輪特措法 山の日　8/11->8/10
//        {2020, 8, 11},
        {2020, 9, 21},
        {2020, 9, 22},
//        {2020, 10, 12},
        {2020, 11, 3},
        {2020, 11, 23},
        {2020, 12, 23},
        {2021, 1, 1},
        {2021, 1, 11},
        {2021, 2, 11},
        {2021, 3, 20},
        {2021, 4, 29},
        {2021, 5, 3},
        {2021, 5, 4},
        {2021, 5, 5},
        {2021, 7, 19},
        {2021, 8, 11},
        {2021, 9, 20},
        {2021, 9, 23},
        {2021, 10, 11},
        {2021, 11, 3},
        {2021, 11, 23},
        {2021, 12, 23},
        {2022, 1, 1},
        {2022, 1, 10},
        {2022, 2, 11},
        {2022, 3, 21},
        {2022, 4, 29},
        {2022, 5, 3},
        {2022, 5, 4},
        {2022, 5, 5},
        {2022, 7, 18},
        {2022, 8, 11},
        {2022, 9, 19},
        {2022, 9, 23},
        {2022, 10, 10},
        {2022, 11, 3},
        {2022, 11, 23},
        {2022, 12, 23},
        {2023, 1, 2},
        {2023, 1, 9},
        {2023, 2, 11},
        {2023, 3, 21},
        {2023, 4, 29},
        {2023, 5, 3},
        {2023, 5, 4},
        {2023, 5, 5},
        {2023, 7, 17},
        {2023, 8, 11},
        {2023, 9, 18},
        {2023, 9, 23},
        {2023, 10, 9},
        {2023, 11, 3},
        {2023, 11, 23},
        {2023, 12, 23},
        {2024, 1, 1},
        {2024, 1, 8},
        {2024, 2, 12},
        {2024, 3, 20},
        {2024, 4, 29},
        {2024, 5, 3},
        {2024, 5, 4},
        {2024, 5, 6},
        {2024, 7, 15},
        {2024, 8, 12},
        {2024, 9, 16},
        {2024, 9, 23},
        {2024, 10, 14},
        {2024, 11, 4},
        {2024, 11, 23},
        {2024, 12, 23},
        {2025, 1, 1},
        {2025, 1, 13},
        {2025, 2, 11},
        {2025, 3, 20},
        {2025, 4, 29},
        {2025, 5, 3},
        {2025, 5, 5},
        {2025, 5, 6},
        {2025, 7, 21},
        {2025, 8, 11},
        {2025, 9, 15},
        {2025, 9, 23},
        {2025, 10, 13},
        {2025, 11, 3},
        {2025, 11, 24},
        {2025, 12, 23},
        {2026, 1, 1},
        {2026, 1, 12},
        {2026, 2, 11},
        {2026, 3, 20},
        {2026, 4, 29},
        {2026, 5, 4},
        {2026, 5, 5},
        {2026, 5, 6},
        {2026, 7, 20},
        {2026, 8, 11},
        {2026, 9, 21},
        {2026, 9, 22},
        {2026, 9, 23},
        {2026, 10, 12},
        {2026, 11, 3},
        {2026, 11, 23},
        {2026, 12, 23},
        {2027, 1, 1},
        {2027, 1, 11},
        {2027, 2, 11},
        {2027, 3, 22},
        {2027, 4, 29},
        {2027, 5, 3},
        {2027, 5, 4},
        {2027, 5, 5},
        {2027, 7, 19},
        {2027, 8, 11},
        {2027, 9, 20},
        {2027, 9, 23},
        {2027, 10, 11},
        {2027, 11, 3},
        {2027, 11, 23},
        {2027, 12, 23},
        {2028, 1, 1},
        {2028, 1, 10},
        {2028, 2, 11},
        {2028, 3, 20},
        {2028, 4, 29},
        {2028, 5, 3},
        {2028, 5, 4},
        {2028, 5, 5},
        {2028, 7, 17},
        {2028, 8, 11},
        {2028, 9, 18},
        {2028, 9, 22},
        {2028, 10, 9},
        {2028, 11, 3},
        {2028, 11, 23},
        {2028, 12, 23},
        {2029, 1, 1},
        {2029, 1, 8},
        {2029, 2, 12},
        {2029, 3, 20},
        {2029, 4, 30},
        {2029, 5, 3},
        {2029, 5, 4},
        {2029, 5, 5},
        {2029, 7, 16},
        {2029, 8, 11},
        {2029, 9, 17},
        {2029, 9, 24},
        {2029, 10, 8},
        {2029, 11, 3},
        {2029, 11, 23},
        {2029, 12, 24},
        {2030, 1, 1},
        {2030, 1, 14},
        {2030, 2, 11},
        {2030, 3, 20},
        {2030, 4, 29},
        {2030, 5, 3},
        {2030, 5, 4},
        {2030, 5, 6},
        {2030, 7, 15},
        {2030, 8, 12},
        {2030, 9, 16},
        {2030, 9, 23},
        {2030, 10, 14},
        {2030, 11, 4},
        {2030, 11, 23},
        {2030, 12, 23}
    };

    static {
        holidays = new HashSet<>();
        for (int[] ymd : holidayData) {
            holidays.add(new GregorianCalendar(ymd[0], ymd[1] - 1, ymd[2]));
        }
    }

    public static boolean isHoliday(GregorianCalendar gc) {

        return holidays.contains(gc) || isNichiyou(gc);
    }
    
    
// おまけ VBAで作成したのを移植
    private static final int[][] regularShukujitsu = {
        { 1,  1},   // 元日
        { 2, 11},   // 建国記念の日
        { 4, 29},   // 昭和の日
        { 5,  3},   // 憲法記念日
        { 5,  4},   // みどりの日
        { 5,  5},   // こどもの日
        {11,  3},   // 文化の日
        {11, 23},   // 勤労感謝の日
        {12, 23}    // 天皇誕生日
    };
    
    private static final int[][] newRegularShukujitsu = {
        {2016,  8, 11},   // 山の日 2016年から
    };
    
    private static final int[][] complexShukujitsu = {
        // 何月の、第何週の、何曜日
        { 1, 2, GregorianCalendar.MONDAY},   // 成人の日
        { 7, 3, GregorianCalendar.MONDAY},   // 海の日
        { 9, 3, GregorianCalendar.MONDAY},   // 敬老の日
        {10, 2, GregorianCalendar.MONDAY},   // 体育の日
    };
    private static final int[][] shukujitsu = {
        // 春分・秋分の日など http://www.nao.ac.jp/QA/faq/a0301.html
        {2009, 3, 20},
        {2009, 9, 23},
        {2010, 3, 21},
        {2010, 9, 23},
        {2011, 3, 21},
        {2011, 9, 23},
        {2012, 3, 20},
        {2012, 9, 22},
        {2013, 3, 20},
        {2013, 9, 23},
        {2014, 3, 21},
        {2014, 9, 23},
        {2015, 3, 21},
        {2015, 9, 23},
        {2016, 3, 20},
        {2016, 9, 22},
        {2017, 3, 20},
        {2017, 9, 23},
        {2018, 3, 21},
        {2018, 9, 23},
        {2019, 3, 21},
        {2019, 9, 23},
        {2020, 3, 20},
        {2020, 9, 22},
        {2021, 3, 20},
        {2021, 9, 23},
        {2022, 3, 21},
        {2022, 9, 23},
        {2023, 3, 21},
        {2023, 9, 23},
        {2024, 3, 20},
        {2024, 9, 22},
        {2025, 3, 20},
        {2025, 9, 23},
        {2026, 3, 20},
        {2026, 9, 23},
        {2027, 3, 21},
        {2027, 9, 23},
        {2028, 3, 20},
        {2028, 9, 22},
        {2029, 3, 20},
        {2029, 9, 23},
        {2030, 3, 20},
        {2030, 9, 23}
    };

    private static boolean isNichiyou(GregorianCalendar gc){
        return gc.get(GregorianCalendar.DAY_OF_WEEK) == GregorianCalendar.SUNDAY;
    }
    
    private boolean isShukujitsu(GregorianCalendar gc){

        int year = gc.get(GregorianCalendar.YEAR);
        int month = gc.get(GregorianCalendar.MONTH) + 1;
        int day = gc.get(GregorianCalendar.DATE);
        int weekOfMonth = gc.get(GregorianCalendar.DAY_OF_WEEK_IN_MONTH);
        int weekDay = gc.get(GregorianCalendar.DAY_OF_WEEK);

        // 日にちの決まった祝日
        for (int[] holiday : newRegularShukujitsu) {
            if (year >= holiday[0] && month == holiday[1] && day == holiday[2]){
                return true;
            }
        }
        for (int[] holiday : regularShukujitsu){
            if (month == holiday[0] && day == holiday[1]){
                return true;
            }
        }
        // 春分の日、秋分の日、その他祝日
        for (int[] holiday : shukujitsu){
            if (year == holiday[0] && month == holiday[1] && day == holiday[2]){
                return true;
            }
        }
        // 何月の第何月曜などの祝日
        for (int[] holiday : complexShukujitsu) {
            if (month == holiday[0] && weekOfMonth == holiday[1] && weekDay == holiday[2]){
                return true;
            }
        }
        return false;
    }

    private boolean isKyujitsu(GregorianCalendar gc){

        int weekDay = gc.get(GregorianCalendar.DAY_OF_WEEK);
        // 日曜日なら休み
        if (weekDay == GregorianCalendar.SUNDAY) {
            return true;
        }
        // 祝日なら休み
        if (isShukujitsu(gc)){
            return true;
        }
        // 前後が祝日なら休み
        GregorianCalendar mae = new GregorianCalendar();
        mae.setTime(gc.getTime());
        mae.add(GregorianCalendar.DATE, -1);
        GregorianCalendar ato = new GregorianCalendar();
        ato.setTime(gc.getTime());
        ato.add(GregorianCalendar.DATE, 1);
        if (isShukujitsu(mae) && isShukujitsu(ato)){
            return true;
        }
        // 前に祝日があって日曜が含まれていれば振り替え休日
        GregorianCalendar test = new GregorianCalendar();
        test.setTime(gc.getTime());
        test.add(GregorianCalendar.DATE, -1);
        while (isShukujitsu(test)){
            if (isNichiyou(test)){
                return true;
            }
            test.add(GregorianCalendar.DATE, -1);
        }
        return false;
    }

    private void start() {

        GregorianCalendar gc = new GregorianCalendar(2009, 0, 1);
        GregorianCalendar end = new GregorianCalendar(2031, 0, 1);

        while (gc.before(end)) {
            if (!isNichiyou(gc) && isKyujitsu(gc)) {
                int year = gc.get(GregorianCalendar.YEAR);
                int month = gc.get(GregorianCalendar.MONTH) + 1;
                int day = gc.get(GregorianCalendar.DATE);
                StringBuilder sb = new StringBuilder();
                sb.append('{').append(year);
                sb.append(", ").append(month);
                sb.append(", ").append(day);
                sb.append("},");
                System.out.println(sb.toString());
            }
            gc.add(GregorianCalendar.DATE, 1);
        }
    }

    public static void main(String[] args) {
        new Holiday().start();
    }

}
